v01-wired-screens/app/controllers/products_controller.rb

  def create
    screen.input_port(:save).push(id: nil, attrs: product_params)
---
INSERT INTO "products" ("name", "description", "amount", "stock", "thumbnail", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "New"], ["description", "d"], ["amount", 42], ["stock", 42], ["thumbnail", "t.png"], ["created_at", "2026-10-05 08:26:11.583881"], ["updated_at", "2026-10-05 08:26:11.583881"]]

  def update
    screen.input_port(:save).push(id: params[:id], attrs: product_params)
---
UPDATE "products" SET "name" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["name", "Renamed"], ["updated_at", "2026-10-05 08:26:11.985410"], ["id", 8]]

  def add_to_cart
    screen.input_port(:add_to_cart).push(params[:id])
---
INSERT INTO "carts" ("status", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["status", "open"], ["created_at", "2026-10-05 08:26:11.950399"], ["updated_at", "2026-10-05 08:26:11.950399"]]