v01-wired-screens/app/models/cart_item.rb

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = 2 AND "cart_items"."product_id" = 1 LIMIT 1
---
  scope :active, -> { where(removed_at: nil).includes(:product).order(:id) }

INSERT INTO "cart_items" ("cart_id", "product_id", "quantity", "gift_wrapped", "removed_at", "created_at", "updated_at") VALUES (2, 1, 1, FALSE, NULL, '2026-10-05 08:44:46.355765', '2026-10-05 08:44:46.355765') RETURNING "id"
---
  def self.add(cart_id, product_id, quantity = 1)
    line = find_or_initialize_by(cart_id:, product_id:)
    line.quantity = line.new_record? ? quantity : line.quantity + quantity
    line.removed_at = nil
    line.save!