v01-wired-screens/app/models/product.rb

UPDATE "products" SET stock = stock - 1 WHERE "products"."id" = 2 AND (stock >= 1)
---
  def self.decrement_stock(id, quantity)
    taken = where(id:).where("stock >= ?", quantity).update_all([ "stock = stock - ?", quantity ])