v01-wired-screens/app/ala/domain_abstractions/undo.rb

UPDATE "cart_items" SET "removed_at" = '2026-10-05 08:45:15.799381', "updated_at" = '2026-10-05 08:45:15.800232' WHERE "cart_items"."id" = 1
---
    # Only the latest removal is undoable: holding a new one makes any other final.
    input(:capture, ProgrammingParadigms::DataFlow) do |item_id|
      finalize(held.where.not(id: item_id))
      @lines.find(item_id).update!(removed_at: Time.current)