v02-wired-rows/app/controllers/portal_lines_controller.rb

  def update
    screen.input_port(:set_quantity).push(item_id: params[:id].to_i, quantity: params[:quantity].to_i)
---
UPDATE "cart_items" SET "quantity" = $1, "updated_at" = $2 WHERE "cart_items"."id" = $3  [["quantity", 1], ["updated_at", "2026-10-05 09:48:34.146598"], ["id", 46]]